namespace WeatherBotApp;

public class WeatherCodeDiscription
{
    public static readonly Dictionary<int, string> Map = new()
    {
        { 0, "Ясно" },
        { 1, "Переважно ясно" },
        { 2, "Мінлива хмарність" },
        { 3, "Хмарно" },
        
        { 45, "Туман" },
        { 48, "Паморозь" },
        
        { 51, "Легкий дощ (мряка)" },
        { 53, "Помірний дощ (мряка)" },
        { 55, "Сильна мряка" },
        { 56, "Слабка крижана мряка" },
        { 57, "Сильна крижана мряка" },
        
        { 61, "Легкий дощ" },
        { 63, "Помірний дощ" },
        { 65, "Сильний дощ" },
        { 66, "Слабкий крижаний дощ" },
        { 67, "Сильний крижаний дощ" },
        
        { 71, "Легкий сніг" },
        { 73, "Помірний сніг" },
        { 75, "Сильний сніг" },
        { 77, "Снігопад з дощем (мокрий сніг)" },
        
        { 80, "Слабкі дощові зливи" },
        { 81, "Помірні дощові зливи" },
        { 82, "Сильні дощові зливи" },
        { 85, "Слабкі снігові зливи" },
        { 86, "Сильні снігові зливи" },
        
        { 95, "Гроза" },
        { 96, "Гроза з легким градом" },
        { 99, "Гроза з сильним градом" }
    };
}